from urllib.parse import quote, quote_plus, urlencode

def url_encode(encode = False):
    product_list = [
        "手机", "笔记本电脑", "运动鞋", "耳机", "智能手表", "电视", "相机", "冰箱", "洗衣机", "空调",
        "微波炉", "吸尘器", "电饭煲", "榨汁机", "咖啡机", "电熨斗", "吹风机", "电动牙刷", "剃须刀",
        "化妆品", "护肤品", "香水", "洗发水", "沐浴露", "篮球", "纸尿裤", "婴儿奶粉", "婴儿推车",
        "儿童玩具", "儿童服装", "手表", "皮鞋", "皮带", "钱包", "牛仔裤", "T恤", "外套", "衬衫",
        "运动服", "泳装", "帽子", "手套", "围巾", "太阳镜", "背包", "公文包", "领带", "丝巾", "睡衣",
        "内衣", "袜子", "运动鞋", "休闲鞋", "正装鞋", "拖鞋", "雪地靴", "皮夹克", "羽绒服", "风衣",
        "毛衣", "POLO衫", "马甲", "皮裤", "皮裙", "皮靴", "皮衣", "平板电脑", "电子书阅读器", "游戏机",
        "乐器", "自行车", "健身器材", "户外装备", "烧烤工具", "钓鱼用品", "园艺工具", "宠物食品", "宠物玩具",
        "宠物床", "宠物服装", "宠物美容用品", "宠物医疗用品", "课本", "杂志", "报纸", "专辑", "音响",
        "厨具", "餐具", "烘焙用品", "酒类", "茶叶", "咖啡豆", "糖果", "巧克力", "保健品", "营养补充剂",
        "医疗器械", "药品", "急救包", "体重秤", "血压计", "血糖仪", "按摩器材", "瑜伽垫", "跑步机",
        "划船机", "椭圆机", "望远镜", "家具", "清洁剂", "窗帘", "地毯", "灯具", "装饰品", "艺术品",
        "墙纸", "油漆", "工具箱", "螺丝刀", "锤子", "电钻", "梯子", "安全摄像头", "烟雾报警器", "一氧化碳报警器"
    ]
    if encode:
        return [quote_plus(product) for product in product_list]
    else:
        return product_list




